package com.programmer.Day01;

public class Demo4 {
    public static void main(String[] args) {
		  //需求:  12345获取这个数的每一位(打印每一位)
    	  // 5 4 3 2 1
    	  //12345 或 5 怎么办?12345%10; // 5这个值
    	  //12345/10%10 --> 1234%10 -->4
//    	  int i = 12345;
//    	  for(;i!=0;) { //循环条件不是单纯的 > >= < <=啊  != 或 == 或 假上逻辑运算符
//    		  System.out.println(i%10); // 5 4
//    		  i = i/10; // 1234 //123 // 12 // 1 // 0 循环变量的自增或自减不是单纯的++ 或 --
//    		  // * 或 /
//    	  }
    	  // 给定一个5位数  12345 得到 54321  12340 得到4321(0不准输出)
    	  //  12034 的到 43021  只要0不是最后一位都要输出
    	  // 这里要的是一个数即 12345 不是单纯的打印
    	  
    	  //循环嵌套
    	  //不是单纯的指for循环 其他循环都可以完成
    	  //双层for循环 外层执行1次 内层执行多次
    	  //break关键字, break关键字只能停止当前循环
    	  //若需要停止最外层循环 添加标签
//    	  EXIT:for(int i1 = 1;i1<=9;i1++) {
//    		  for(int j1 = 1;j1<=9;j1++) {
//    			    if(j1== 3) {
//    			    	break EXIT;
//    			    }
//    		  }
//    		  
//    	  }
        //99乘法表
    	  for(int i = 1 ;i<=9;i++) {// 控制行
    		  for(int j =1 ;j<=i;j++) {
    			  System.out.print(j+"x"+i+"="+j*i+"\t");
    		  }
    		  System.out.println();
    	  }
    	  
    	  
    	  
    	  
    	  
    	
    	
    	
    	
    	
    	
    	
    	
    	  
    	  
    	  
    	  
	}
}
